app/views/user/editPublico.html.erb

					<div class="controls">
						<%= f.text_field :usuario,:size => 20, :onchange => "checkUser(this.value)" %>
---
SELECT `usuarios`.* FROM `usuarios` WHERE (id = '75' AND token = 'a35b78fe9865ad4e2f52') LIMIT 1