app/views/user/edit.html.erb

					<div class="controls">
						<%= f.text_field :usuario,:size => 20, :onchange => "checkUser(this.value)" %>
---
SELECT `usuarios`.* FROM `usuarios` WHERE (usuario = 'rodrigomt') LIMIT 1