app/views/user/signup.html.erb

SELECT `usuarios`.* FROM `usuarios` WHERE (usuario = 'rodrigomt') LIMIT 1
---
				<div class="controls">
					<%= f.text_field :usuario,:size => 20, :onchange => "checkUser(this.value)" %> <span id="check_user" ></span>