app/views/usuarios/signup.html.erb

				<div class="controls">
					<%= f.text_field :usuario,:size => 20, :onchange => "checkUser(this.value)" %> <span id="check_user" class="label label-important"></span>
---
SELECT `usuarios`.* FROM `usuarios` WHERE (usuario = 'hspencer') LIMIT 1