app/controllers/admin_controller.rb

SELECT `usuarios`.* FROM `usuarios` WHERE (usuario = 'rodrigomt') LIMIT 1
---
	def maillist
		if isAdmin?
			@loged = Usuario.find(:first, :conditions =>["usuario = ?", session[:cas_user]])

SELECT `usuarios`.* FROM `usuarios` WHERE (usuario = 'rodrigomt') LIMIT 1
---
	def makeMailList
		if isAdmin?
			@ids = params[:por_lote]
			@notificacion = "<div class='alert alert-success'>"
			for id in @ids
				@usuario = Usuario.find(id)

SELECT `usuarios`.* FROM `usuarios` WHERE (usuario = 'rodrigomt') LIMIT 1
UPDATE `usuarios` SET `admin` = 'si' WHERE (`usuarios`.`id` = 127)
---
	def userIsAdmin
		if isAdmin?
			@usuario = Usuario.find(params[:id])
			if params[:accion] == "y"
				@datos = {"admin"=>"si"}
			else
				@datos = {"admin"=>"no"}
			end
			@usuario.update_attributes(@datos)

SELECT `usuarios`.* FROM `usuarios` WHERE (usuario = 'rodrigomt') LIMIT 1
DELETE FROM `usuarios` WHERE (`usuarios`.`id` = 3)
---
	def blockXlote
		if isAdmin?
			@ids = params[:por_lote]
			@notificacion = ""
			for id in @ids
				@sql = "INSERT INTO usuariosbloqueados( id, rut, nombre, apellido, mail, mail_2, mail_3, telefono_fijo, telefono_cel, direccion, tipo, anoingreso, carrera, web, twitter, flickr, usuario, password, token, bio )
				  SELECT id, rut, nombre, apellido, mail, mail_2, mail_3, telefono_fijo, telefono_cel, direccion, tipo, anoingreso, carrera, web, twitter, flickr, usuario, password, token, bio FROM usuarios WHERE id =#{id}"

			   ActiveRecord::Base.establish_connection
				ActiveRecord::Base.connection.execute(@sql)
				@usuario = Usuario.find(id)
				@usuario.destroy

SELECT `usuariosbloqueados`.* FROM `usuariosbloqueados` WHERE (`usuariosbloqueados`.`id` = 124) LIMIT 1
DELETE FROM `usuariosbloqueados` WHERE (`usuariosbloqueados`.`id` = 124)
---
	def deleteXlote
		if isAdmin?
			@ids 	= params[:por_lote]
			@option = params[:o]
			@notificacion = ""

			if @option == "all"
				@sql = "TRUNCATE TABLE usuariosbloqueados"
			    	ActiveRecord::Base.establish_connection
				ActiveRecord::Base.connection.execute(@sql)
				@notificacion << "<script>new Effect.Fade('list');</script>"
			end

			if @option == "custom"
				for id in @ids
					@usuario = Usuariosbloqueados.find(id)
					@usuario.destroy

SELECT `usuarios`.* FROM `usuarios` WHERE (usuario = 'rodrigomt') LIMIT 1
DELETE FROM `usuarios` WHERE (`usuarios`.`id` = 124)
---
	def block
		if isAdmin?
			@id = params['id']
			@sql = "INSERT INTO usuariosbloqueados( id, rut, nombre, apellido, mail, mail_2, mail_3, telefono_fijo, telefono_cel, direccion, tipo, anoingreso, carrera, web, twitter, flickr, usuario, password, token, bio )
				  SELECT id, rut, nombre, apellido, mail, mail_2, mail_3, telefono_fijo, telefono_cel, direccion, tipo, anoingreso, carrera, web, twitter, flickr, usuario, password, token, bio FROM usuarios WHERE id =#{@id}"

			## no se si esto es la manera mas elegante de ejecutar un query complejos..
		   ActiveRecord::Base.establish_connection
			ActiveRecord::Base.connection.execute(@sql)

			@usuario = Usuario.find(params[:id])
			@usuario.destroy

SELECT `usuariosbloqueados`.* FROM `usuariosbloqueados` WHERE (`usuariosbloqueados`.`id` = 71) LIMIT 1
SELECT `usuarios`.* FROM `usuarios` WHERE (usuario = 'rodrigomt') LIMIT 1
DELETE FROM `usuariosbloqueados` WHERE (`usuariosbloqueados`.`id` = 71)
---
	def desblock
		if isAdmin?
			@id = params['id']
			@usuarioBlock = Usuariosbloqueados.find(params[:id])

			#busco si el usuario que quiere ser desbloqueado a sido creado en la tabla oficial.
			@u = Usuario.find(:first, :conditions => ["usuario = ?", @usuarioBlock.usuario])

			if @u.blank?
				@sql = "INSERT INTO usuarios( id, rut, nombre, apellido, mail, mail_2, mail_3, telefono_fijo, telefono_cel, direccion, tipo, anoingreso, carrera, web, twitter, flickr, usuario, password, token, bio )
				  	SELECT id, rut, nombre, apellido, mail, mail_2, mail_3, telefono_fijo, telefono_cel, direccion, tipo, anoingreso, carrera, web, twitter, flickr, usuario, password, token, bio FROM usuariosbloqueados WHERE id =#{@id}"

		    	ActiveRecord::Base.establish_connection
				ActiveRecord::Base.connection.execute(@sql)
				@usuarioBlock.destroy

SELECT `usuarios`.* FROM `usuarios` WHERE (usuario = 'rodrigomt') LIMIT 1
UPDATE `usuarios` SET `tipo` = 'f' WHERE (`usuarios`.`id` = 3)
---
	def changeUserType
		if isAdmin?
			@ids = params[:por_lote]
			@tipo = params[:t]
			@notificacion = Array.new()
			for id in @ids
				@usuario = Usuario.find(id)
				@dato = {"tipo"=> @tipo}
				@usuario.update_attributes(@dato)

SELECT COUNT(*) FROM `usuarios` WHERE (nombre LIKE '%rodrigo%' OR apellido LIKE '%rodrigo%' OR mail LIKE '%rodrigo%' OR usuario LIKE '%rodrigo%')
SELECT `usuarios`.* FROM `usuarios` WHERE (nombre LIKE '%moya%' OR apellido LIKE '%moya%' OR email LIKE '%moya%' OR usuario LIKE '%moya%') LIMIT 30 OFFSET 0
---
	def list
		if isAdmin?
			if params[:txt]
				@usuarios = Usuario.paginate(:conditions=>["nombre LIKE ? OR apellido LIKE ? OR mail LIKE ? OR usuario LIKE ?","%"+params[:txt]+"%","%"+params[:txt]+"%","%"+params[:txt]+"%","%"+params[:txt]+"%"], :page => params[:page], :per_page => 30)