app/controllers/usuarios_controller.rb

	def enviaRecuperaMail
		@tipo ="recupera"
		@usuario = Usuario.find(:first, :conditions => ["mail = ?", params[:mail]])
---
SELECT `usuarios`.* FROM `usuarios` WHERE (mail = 'hspencer@ead.cl') LIMIT 1

	def maillist
		@loged = Usuario.find(:first, :conditions =>["usuario = ?", session[:cas_user]])
---
SELECT `usuarios`.* FROM `usuarios` WHERE (usuario = 'hspencer') LIMIT 1

	def block
		@id = params['id']
		@sql = "INSERT INTO usuariosbloqueados( id, rut, nombre, apellido, mail, mail_2, mail_3, telefono_fijo, telefono_cel, direccion, tipo, anoingreso, carrera, web, twitter, flickr, usuario, password, token, bio )
			  SELECT id, rut, nombre, apellido, mail, mail_2, mail_3, telefono_fijo, telefono_cel, direccion, tipo, anoingreso, carrera, web, twitter, flickr, usuario, password, token, bio FROM usuarios WHERE id =#{@id}"


		## no se si esto es la manera mas elegante de ejecutar un query complejos..
	    	ActiveRecord::Base.establish_connection
		ActiveRecord::Base.connection.execute(@sql)

		@usuario = Usuario.find(params[:id])
		@usuario.destroy
---
SELECT `usuarios`.* FROM `usuarios` WHERE (`usuarios`.`id` = 10) LIMIT 1
DELETE FROM `usuarios` WHERE (`usuarios`.`id` = 10)

	def list
		if verificaAdmin()==FALSE
			redirect_to :action => 'index'
		end
		#@personas_page, @usuarios = paginate(:usuarios, :per_page => 30)
		#@usuarios = Usuario.find(:all,:limit=>50)
		@usuarios = Usuario.paginate(:page => params[:page], :per_page => 30)
---
SELECT COUNT(*) FROM `usuarios`
SELECT `usuarios`.* FROM `usuarios` WHERE (usuario = 'hspencer') LIMIT 1

	def live_search
		if params[:search_type]
			@tipo = params[:search_type]
		else
			@tipo = "apellidos"
		end
		@texto = params[:txt]

		if (@texto == "") || (@texto == nil)
			@usuarios = Usuario.paginate(:page => params[:page], :per_page => 30)
---
SELECT COUNT(*) FROM `usuarios`
SELECT `usuarios`.* FROM `usuarios` WHERE (mail LIKE '%gonzal%')

	def checkUser
		@usuario = Usuario.find(:all, :conditions => ["usuario = ? ", params[:user]])
---
SELECT `usuarios`.* FROM `usuarios` WHERE (usuario = 'peple' )

	def checkMail
		@usuario = Usuario.find(:all, :conditions => ["mail = ? ", params[:mail]])
---
SELECT `usuarios`.* FROM `usuarios` WHERE (mail = 'herbert@citisent.com' )

	def edit
		@id = params[:id]
		@usuario = Usuario.find(params[:id])
---
SELECT `usuarios`.* FROM `usuarios` WHERE (usuario = 'hspencer') LIMIT 1